# **Heroes of Pymoli Data Analysis Observations:**

* There is disproportionate % players by gender. Ratio of **Male players ~ Female + Others** is roughly **8:2**.
* Purchase rate or Female and Other is higher than Male though Male out number Female+ Others.
* As Age increases (above 24 years), % of players starts decreasing. 
* 75% of spending power (purchases made by) is with people from 25-29 years old.
* Most popular items are expensive *i.e. has higher item price.*
* Most profitable items overlap with most popular items which has higher item price.

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import os

#File_to_load - Preapre data file folder path
file_to_load= os.path.join("","Resources","purchase_data.csv")

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [2]:
#Verify - data frame created
purchase_data.head(2)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56

In [3]:
#Create blank dataframe and assign player count 
total_playes=pd.DataFrame()
total_playes["Total Players"]=[purchase_data["SN"].nunique()]

In [4]:
#Display the result
total_playes.head()

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
#Unique items
item_count= purchase_data["Item ID"].nunique()
item_count

183

In [6]:
#Average price 
average_price =purchase_data["Price"].sum()/purchase_data["Item Name"].count()
average_price

3.0509871794871795

In [7]:
#Number of purchases
purchase_count = purchase_data["Purchase ID"].count()
purchase_count

780

In [8]:
#Total Revenue - There are two ways:
    #1. As there is one item per order, sum of prices will give revenue
    #2. Purchase count * average price
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [9]:
#Alternate menthod for total revenue
total_revenue = average_price*purchase_count
total_revenue

2379.77

In [10]:
#Build dictionary from above values
purchase_analysis_dict={"Number of Unique Items":item_count,"Average Price": "${:,.2f}".format(average_price),
                   "Number of Purchases":purchase_count, "Total Revenue": "${:,.2f}".format(total_revenue)}

In [11]:
#Get values in dataframe
purchase_analysis=pd.DataFrame([purchase_analysis_dict])

In [12]:
#Display results
purchase_analysis

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [13]:
#Check dataframe
purchase_data.head(2)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56

In [14]:
#Get the required data from purchase data frame and display the results
player_data = purchase_data[["SN"]].groupby(purchase_data["Gender"]).nunique()
player_data.head()

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [15]:
#Reset the index
player_data=player_data.reset_index()

In [16]:
#Get total players
total_player = player_data["SN"].sum()
total_player

576

In [17]:
#Calculate % of female
percentage_female = (player_data.SN[player_data["Gender"]=="Female"]/total_player)*100
percentage_female

0    14.0625
Name: SN, dtype: float64

In [18]:
#Calculate % male
percentage_male = (player_data.SN[player_data["Gender"]=="Male"]/total_player)*100
percentage_male

1    84.027778
Name: SN, dtype: float64

In [19]:
#Calculate % others
percentage_other = (player_data.SN[player_data["Gender"]=="Other / Non-Disclosed"]/total_player)*100
percentage_other

2    1.909722
Name: SN, dtype: float64

In [20]:
#Covert values to flot- this to apply formatting
percentage_female = float(percentage_female)
percentage_male=float(percentage_male)
percentage_other=float(percentage_other)

In [21]:
#Add % Female, Male and Other in player data 
player_data["Percentage of Players"]=["{:,.2f}%".format(percentage_female),"{:,.2f}%".format(percentage_male),"{:,.2f}%".format(percentage_other)]

In [22]:
#Sort the data by gender
player_data.sort_values(by=["Percentage of Players"], inplace=True, ascending=False)

In [23]:
#Update column name
player_data.rename(columns = {"SN":"Total Count"}, inplace = True)
player_data.rename(columns = {"Gender":""}, inplace = True)

In [24]:
#Verify results
player_data.head()

                          Total Count Percentage of Players
1                   Male          484                84.03%
0                 Female           81                14.06%
2  Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [25]:
#Examine basline data
purchase_data.head(2)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56

In [26]:
#Create data frame - copy
purchase_analysis =purchase_data

In [27]:
#Get purchase count and verify sample data
purchase_count = purchase_analysis.groupby(purchase_analysis["Gender"]).count()["Purchase ID"]
purchase_count.head()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [28]:
#Calculate average purchase price and verify sample data
average_purchase_price = purchase_analysis["Price"].groupby(purchase_analysis["Gender"]).mean()
average_purchase_price.head()

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [29]:
#Calculate total purchase value and verify sample data
total_purchase_value=purchase_analysis["Price"].groupby(purchase_analysis["Gender"]).sum()
total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [30]:
#Calculate average total purchase per person and verify sample data
avg_total_purchase_per_person=total_purchase_value/(purchase_analysis["SN"].groupby(purchase_data["Gender"]).nunique())
avg_total_purchase_per_person

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [31]:
#Now we have 4 series-lets build data frame
purchase_analysis=pd.DataFrame({"Purchase Count":purchase_count,
                                "Average Purchase Price":average_purchase_price,
                                "Total Purchase Value":total_purchase_value,
                                "Avg Total Purchase per Person":avg_total_purchase_per_person})

In [32]:
#Apply formatting
purchase_analysis[["Average Purchase Price","Total Purchase Value","Avg Total Purchase per Person"]] = purchase_analysis[["Average Purchase Price","Total Purchase Value","Avg Total Purchase per Person"]].applymap("${:.2f}".format)

In [33]:
#Verify result
purchase_analysis.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [34]:
#Copy player revant data from purchase data Dataframe
age_demographics =purchase_data[["SN","Age"]]
age_demographics.head(2)

            SN  Age
0      Lisim78   20
1  Lisovynya38   40

In [35]:
#Drop duplicate rows
age_demographics =age_demographics.drop_duplicates()

In [36]:
#Establish bins and bins categories for age and age range
ages=[0,9,14,19,24,29,34,39,45]
age_category=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [37]:
#Categorize the existing players age using the age bins.
age_demographics["age_cat"] = pd.cut(age_demographics["Age"],bins=ages,labels=age_category)

In [38]:
#Sampling results
age_demographics.head(2)

            SN  Age age_cat
0      Lisim78   20   20-24
1  Lisovynya38   40     40+

In [39]:
#Get uniue players count -used for % calculation
player_count=age_demographics["SN"].nunique()
player_count

576

In [40]:
#Group by to get total count in that age group/range
age_demographics = age_demographics.groupby(age_demographics["age_cat"]).count()
age_demographics.head(2)

         SN  Age
age_cat
<10      17   17
10-14    22   22

In [41]:
#Convert series into dataframe and verify result
age_demographics=pd.DataFrame(age_demographics)
age_demographics.head(2)

         SN  Age
age_cat
<10      17   17
10-14    22   22

In [42]:
#Reset index and verify result
age_demographics=age_demographics.reset_index()
age_demographics.head(2)

  age_cat  SN  Age
0     <10  17   17
1   10-14  22   22

In [43]:
#Calculate % of player: Player(age range) count/total # of players
age_demographics["Percentage of Players"]=((age_demographics["SN"]/player_count)*100).map("{:.2f}%".format)

In [44]:
#Verify results
age_demographics.head(2)

  age_cat  SN  Age Percentage of Players
0     <10  17   17                 2.95%
1   10-14  22   22                 3.82%

In [45]:
#Only keep required columns
age_demographics = age_demographics[["age_cat","SN","Percentage of Players"]]

In [46]:
#Rename columms 
age_demographics = age_demographics.rename(columns={'SN':"Total Count"})
age_demographics = age_demographics.rename(columns={'age_cat':""})

In [47]:
#Display results
age_demographics

          Total Count Percentage of Players
0    <10           17                 2.95%
1  10-14           22                 3.82%
2  15-19          107                18.58%
3  20-24          258                44.79%
4  25-29           77                13.37%
5  30-34           52                 9.03%
6  35-39           31                 5.38%
7    40+           12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [48]:
#Copy player revant data from purchase data Dataframe
age_purchase_analysis =purchase_data[["SN","Age","Purchase ID","Price"]]
age_purchase_analysis.head(2)

            SN  Age  Purchase ID  Price
0      Lisim78   20            0   3.53
1  Lisovynya38   40            1   1.56

In [49]:
#Average Purchase Price and Average total purchase per person cannot be calculated by age group

In [50]:
#Get number of purchases by age and verify result
purchase_counts = age_purchase_analysis.groupby(age_purchase_analysis["Age"]).count()["SN"]
purchase_counts.head(2)

Age
7    9
8    8
Name: SN, dtype: int64

In [51]:
#Check number of unique purchase users/players 
total_unique =age_purchase_analysis["SN"].groupby(age_purchase_analysis["Age"]).nunique().sum()
total_unique

576

In [52]:
#Get Total Purchase Value by age and verify data
purchase_totalvalue_age=age_purchase_analysis["Price"].groupby(age_purchase_analysis["Age"]).sum()
purchase_totalvalue_age.head(2)

Age
7    32.89
8    25.97
Name: Price, dtype: float64

In [53]:
#Get unique purchase counts by age and verify data
unique_purchase_count = age_purchase_analysis["SN"].groupby(age_purchase_analysis["Age"]).nunique()
unique_purchase_count.head(2)

Age
7    7
8    6
Name: SN, dtype: int64

In [54]:
#Build Data Frame - pending Average Purchase Price which will be added after binning results
age_purchase_analysis=pd.DataFrame({"Purchase Count":purchase_counts,
                                    "Total Purchase Value":purchase_totalvalue_age,
                                     "Unique Purchasers":unique_purchase_count})

In [55]:
#Examin results
age_purchase_analysis.head(2)

     Purchase Count  Total Purchase Value  Unique Purchasers
Age
7                 9                 32.89                  7
8                 8                 25.97                  6

In [56]:
#Reset index before binning
age_purchase_analysis =age_purchase_analysis.reset_index()

In [57]:
#Establish bins and bins categories for age and age range
ages=[0,9,14,19,24,29,34,39,45]
age_category=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [58]:
#Categorize the existing players age using the age bins.
age_purchase_analysis["Age Ranges"] = pd.cut(age_purchase_analysis["Age"],bins=ages,labels=age_category)

In [59]:
#verify for binning results
age_purchase_analysis.head(5)

   Age  Purchase Count  Total Purchase Value  Unique Purchasers Age Ranges
0    7               9                 32.89                  7        <10
1    8               8                 25.97                  6        <10
2    9               6                 18.27                  4        <10
3   10               9                 31.83                  7      10-14
4   11               7                 18.79                  6      10-14

In [60]:
#Use agrregate function to calculate sums of Purchase Count, Total Purchase Value and unique purchasers
age_purchase_analysis = age_purchase_analysis.groupby(["Age Ranges"]).agg({'Purchase Count': 'sum', 'Total Purchase Value': 'sum','Unique Purchasers':'sum'})

In [61]:
#Examin results
age_purchase_analysis.head(2)

            Purchase Count  Total Purchase Value  Unique Purchasers
Age Ranges
<10                     23                 77.13                 17
10-14                   28                 82.78                 22

In [62]:
#Add Average Purchase PriceTotal Purchase Value
age_purchase_analysis["Average Purchase Price"]=age_purchase_analysis["Total Purchase Value"]/age_purchase_analysis["Purchase Count"]

In [63]:
# Add Avg Total Purchase per Person column and value - New
age_purchase_analysis["Avg Total Purchase per Person"]=age_purchase_analysis["Total Purchase Value"]/age_purchase_analysis["Unique Purchasers"]

In [64]:
#Format columns - rounding and $ sign
age_purchase_analysis[["Average Purchase Price","Total Purchase Value","Avg Total Purchase per Person"]]=age_purchase_analysis[["Average Purchase Price","Total Purchase Value","Avg Total Purchase per Person"]].applymap("${:.2f}".format)

In [65]:
#R-eorder Columns
age_purchase_analysis = age_purchase_analysis[["Purchase Count","Average Purchase Price","Total Purchase Value","Avg Total Purchase per Person"]]

In [66]:
age_purchase_analysis.head(10)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [67]:
#Copy player revant data from purchase data Dataframe
user_purchase_analysis =purchase_data[["SN","Purchase ID","Price"]]
user_purchase_analysis.head(2)

            SN  Purchase ID  Price
0      Lisim78            0   3.53
1  Lisovynya38            1   1.56

In [68]:
#Get number of purchases by user and verify result
user_purchase_count = user_purchase_analysis.groupby("SN").count()["Purchase ID"]
user_purchase_count.head(2)

SN
Adairialis76    1
Adastirin33     1
Name: Purchase ID, dtype: int64

In [69]:
#Get Total Purchase Value by user and verify data
user_purchase_totalvalue=user_purchase_analysis.groupby("SN").sum() ["Price"]
user_purchase_totalvalue.head(2)

SN
Adairialis76    2.28
Adastirin33     4.48
Name: Price, dtype: float64

In [70]:
#Build Data Frame - Average Purchase Price which will be added after rolling the data by user
user_purchase_analysis=pd.DataFrame({"Purchase Count":user_purchase_count,
                                    "Total Purchase Value":user_purchase_totalvalue})

In [71]:
#Spot check results
user_purchase_analysis.head(2)

              Purchase Count  Total Purchase Value
SN
Adairialis76               1                  2.28
Adastirin33                1                  4.48

In [72]:
#Use agrregate function to get sum of Purchase Count and Total Purchase Value
user_purchase_analysis = user_purchase_analysis.groupby(["SN"]).agg({'Purchase Count': 'sum', 'Total Purchase Value': 'sum'})

In [73]:
#Add Average Purchase PriceTotal Purchase Value
user_purchase_analysis["Average Purchase Price"]=user_purchase_analysis["Total Purchase Value"]/user_purchase_analysis["Purchase Count"]

In [74]:
#Re-aarnage columns
user_purchase_analysis=user_purchase_analysis[["Purchase Count","Average Purchase Price","Total Purchase Value"]]

In [75]:
#Spot check results
user_purchase_analysis.head(2)

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48

In [76]:
#Sort by top spender and verify results
user_purchase_analysis.sort_values(by="Total Purchase Value",ascending=False,inplace=True)
user_purchase_analysis.head(2)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                  3.7920                 18.96
Idastidru52               4                  3.8625                 15.45

In [77]:
#Format values
user_purchase_analysis[["Total Purchase Value","Average Purchase Price"]]=user_purchase_analysis[["Total Purchase Value","Average Purchase Price"]].applymap("${:.2f}".format)

In [78]:
#Display results of top 5 spenders
user_purchase_analysis.head(5)

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [79]:
# Examin baseline data
purchase_data.head(2)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56

In [80]:
#Select required info from purchase data frame and display sample result
profitable_items = purchase_data[["Item ID","Item Name","Purchase ID","Price","SN"]]
profitable_items.head(2)

,Item ID,Item Name,Purchase ID,Price,SN
0,108,"Extraction, Quickblade Of Trembling Hands",0,3.53,Lisim78
1,143,Frenzied Scimitar,1,1.56,Lisovynya38

In [81]:
#Get Purchase count by Items and item Name
purchase_count = profitable_items.groupby(["Item ID","Item Name"]).count()["Purchase ID"]
purchase_count.head(2)

Item ID  Item Name
0        Splinter     4
1        Crucifer     3
Name: Purchase ID, dtype: int64

In [82]:
#Get Item Total Purchase Price by Items and item Name
item_total_purchase = profitable_items.groupby(["Item ID","Item Name"]).sum()["Price"]
item_total_purchase.head(2)

Item ID  Item Name
0        Splinter     5.12
1        Crucifer     9.78
Name: Price, dtype: float64

In [83]:
#Build Data Frame - Average Item Price which will be calculated  after rolling the data by item
profitable_items=pd.DataFrame({"Purchase Count":purchase_count,
                                "Total Purchase Value":item_total_purchase})

In [84]:
#Calculate Average Item Price
item_price = profitable_items["Total Purchase Value"]/profitable_items["Purchase Count"]

In [85]:
#Add Item Price in to data frame 
profitable_items["Item Price"]=item_price

In [86]:
#Verify sample results
profitable_items.head(2)

                   Purchase Count  Total Purchase Value  Item Price
Item ID Item Name
0       Splinter                4                  5.12        1.28
1       Crucifer                3                  9.78        3.26

In [87]:
#Sort by purchase count
profitable_items.sort_values(by="Purchase Count", inplace=True, ascending=False)

In [88]:
#Format the columns
profitable_items[["Item Price","Total Purchase Value"]]=profitable_items[["Item Price","Total Purchase Value"]].applymap("${:.2f}".format)

In [89]:
#Re-arrange columns
profitable_items =profitable_items[["Purchase Count","Item Price","Total Purchase Value"]]

In [90]:
#Display results
profitable_items.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [91]:
#Remove formatting of total Purchase Value for sorting 
profitable_items["Total Purchase Value"] = profitable_items["Total Purchase Value"].str.replace("$","").astype(float)

In [92]:
#Sort by Total Purchase Value
profitable_items.sort_values(by="Total Purchase Value", inplace=True, ascending=False)

In [93]:
#Add formatting to sorted column
profitable_items["Total Purchase Value"] = profitable_items[["Total Purchase Value"]].applymap("${:.2f}".format)

In [94]:
#Display top by Total Purchase Value items
profitable_items.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80